-- Заполнение таблицы ro_person
INSERT INTO ro_person (gender, first_name, last_name, patronymic, date_of_birth)
VALUES
(1, 'Иван', 'Иванов', 'Иванович', '1990-05-15'),
(1, 'Петр', 'Петров', 'Петрович', '1985-11-22'),
(2, 'Мария', 'Сидорова', 'Ивановна', '1992-03-08'),
(1, 'Алексей', 'Смирнов', 'Алексеевич', '1978-07-30'),
(2, 'Елена', 'Кузнецова', 'Сергеевна', '1989-09-14');

-- Заполнение таблицы ro_passport
INSERT INTO ro_passport (person_id, seria, number, issue_date, issue_department)
VALUES
(1, '4501', '123456', '2015-06-20', 'ОУФМС России по г. Москва'),
(2, '4502', '654321', '2016-11-10', 'ОУФМС России по г. Санкт-Петербург'),
(3, '4503', '789012', '2017-04-05', 'ОУФМС России по г. Екатеринбург'),
(4, '4504', '210987', '2018-09-15', 'ОУФМС России по г. Новосибирск'),
(5, '4505', '345678', '2019-02-28', 'ОУФМС России по г. Казань');